
## Plan Result (prod)




### :warning: Resource Deletion will happen
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 1 to import, 2 to add, 11 to change, 1 to destroy.</code></pre>

* Create
  * random_uuid.scope_api_request_b2c
* Update
  * azuread_application.api_app
  * azurerm_key_vault_secret.appinsights-key
  * azurerm_key_vault_secret.appinsights_connection_string
  * azurerm_key_vault_secret.edit_password[0]
  * azurerm_key_vault_secret.sa_storage_account_connection_string
  * azurerm_key_vault_secret.vodasa_storage_account_connection_string
  * azurerm_key_vault_secret.vodasa_storage_account_primary_access_key
  * azurerm_monitor_metric_alert.storage_ingest_alert_capacity[0]
  * module.finalsa_storage_account.azurerm_storage_account.storage_account
  * module.ingestsa_storage_account.azurerm_storage_account.storage_account
  * module.vodasa_storage_account.azurerm_storage_account.storage_account
* Replace
  * module.data_store_db_v14.azurerm_postgresql_flexible_server_active_directory_administrator.pgsql_adadmin
* Import
  * azuread_application.api_app


<details><summary>Change Result (Click me)</summary>

```hcl

  # azuread_application.api_app will be updated in-place
  # (imported from "/applications/8879f7d3-edf7-4452-a51b-33770bc29c8d")
  ~ resource "azuread_application" "api_app" {
        app_role_ids                   = {}
        client_id                      = "0bb27118-d32b-488c-8044-d7f34b99f460"
      - description                    = "Used by PRE B2C to talk to PRE Notify API - Prod" -> null
        device_only_auth_enabled       = false
        disabled_by_microsoft          = null
        display_name                   = "pre-apim-b2c-prod"
        fallback_public_client_enabled = false
        group_membership_claims        = []
        id                             = "/applications/8879f7d3-edf7-4452-a51b-33770bc29c8d"
      ~ identifier_uris                = [
          + "api://0bb27118-d32b-488c-8044-d7f34b99f460",
        ]
        logo_image                     = null
        logo_url                       = null
        marketing_url                  = null
      - notes                          = "This service principal created by hmcts/central-app-registration repository" -> null
      ~ oauth2_permission_scope_ids    = {} -> (known after apply)
        oauth2_post_response_required  = false
        object_id                      = "8879f7d3-edf7-4452-a51b-33770bc29c8d"
        owners                         = []
        prevent_duplicate_names        = false
        privacy_statement_url          = null
        publisher_domain               = "HMCTS.NET"
        service_management_reference   = null
        sign_in_audience               = "AzureADMyOrg"
        support_url                    = null
        tags                           = []
        template_id                    = null
        terms_of_service_url           = null

      ~ api {
            known_client_applications      = []
            mapped_claims_enabled          = false
            requested_access_token_version = 2

          + oauth2_permission_scope {
              + admin_consent_description  = "Allow the caller to perform B2C request operations."
              + admin_consent_display_name = "PRE prod Request B2C"
              + enabled                    = true
              + id                         = (known after apply)
              + type                       = "Admin"
              + user_consent_description   = "Allow the caller to perform B2C request operations."
              + user_consent_display_name  = "PRE prod Request B2C"
              + value                      = "api.request.b2c"
            }
        }

        feature_tags {
            custom_single_sign_on = false
            enterprise            = false
            gallery               = false
            hide                  = false
        }

        public_client {
            redirect_uris = []
        }

        single_page_application {
            redirect_uris = []
        }

        web {
            homepage_url  = null
            logout_url    = null
            redirect_uris = []

            implicit_grant {
                access_token_issuance_enabled = false
                id_token_issuance_enabled     = false
            }
        }
    }

  # azurerm_key_vault_secret.appinsights-key will be updated in-place
  ~ resource "azurerm_key_vault_secret" "appinsights-key" {
      - expiration_date         = "2026-06-01T01:00:00Z" -> null
        id                      = "https://pre-hmctskv-prod.vault.azure.net/secrets/AppInsightsInstrumentationKey/3f0b5b0015844ecdab6c3712482dd017"
        name                    = "AppInsightsInstrumentationKey"
        tags                    = {}
        # (9 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.appinsights_connection_string will be updated in-place
  ~ resource "azurerm_key_vault_secret" "appinsights_connection_string" {
      - expiration_date         = "2026-06-01T01:00:00Z" -> null
        id                      = "https://pre-hmctskv-prod.vault.azure.net/secrets/app-insights-connection-string/6bcd095bf8684e48a86eb1d701fc4e9b"
        name                    = "app-insights-connection-string"
        tags                    = {}
        # (9 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.edit_password[0] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "edit_password" {
      - expiration_date         = "2026-06-01T01:00:00Z" -> null
        id                      = "https://pre-hmctskv-prod.vault.azure.net/secrets/videditvm1-password/76b1845bc8044195b61bde3d404bb83e"
        name                    = "videditvm1-password"
        tags                    = {}
        # (9 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.sa_storage_account_connection_string will be updated in-place
  ~ resource "azurerm_key_vault_secret" "sa_storage_account_connection_string" {
      - expiration_date         = "2026-06-01T01:00:00Z" -> null
        id                      = "https://pre-hmctskv-prod.vault.azure.net/secrets/sa-storage-account-connection-string/54fa132345714daea67251a1f1c32d97"
        name                    = "sa-storage-account-connection-string"
        tags                    = {}
        # (9 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.vodasa_storage_account_connection_string will be updated in-place
  ~ resource "azurerm_key_vault_secret" "vodasa_storage_account_connection_string" {
      - expiration_date         = "2026-06-01T01:00:00Z" -> null
        id                      = "https://pre-hmctskv-prod.vault.azure.net/secrets/vodasa-storage-account-connection-string/432370f5d99d47068e93f0e9e0e0fda4"
        name                    = "vodasa-storage-account-connection-string"
        tags                    = {}
        # (9 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.vodasa_storage_account_primary_access_key will be updated in-place
  ~ resource "azurerm_key_vault_secret" "vodasa_storage_account_primary_access_key" {
      - expiration_date         = "2026-06-01T01:00:00Z" -> null
        id                      = "https://pre-hmctskv-prod.vault.azure.net/secrets/vodasa-storage-account-primary-access-key/4550b7d2873a4fc3963b0628b5366412"
        name                    = "vodasa-storage-account-primary-access-key"
        tags                    = {}
        # (9 unchanged attributes hidden)
    }

  # azurerm_monitor_metric_alert.storage_ingest_alert_capacity[0] will be updated in-place
  ~ resource "azurerm_monitor_metric_alert" "storage_ingest_alert_capacity" {
        id                       = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/pre-prod/providers/Microsoft.Insights/metricAlerts/used_capacity"
        name                     = "used_capacity"
      ~ scopes                   = [
          - "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/pre-prod/providers/Microsoft.Storage/storageAccounts/prefinalsaprod",
          + "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/pre-prod/providers/Microsoft.Storage/storageAccounts/preingestsaprod",
        ]
        tags                     = {
            "application"         = "pre-recorded-evidence"
            "builtFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#dts-pre-rec-evidence-tech"
            "environment"         = "production"
            "managedBy"           = "Pre Recorded Evidence"
        }
        # (9 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # random_uuid.scope_api_request_b2c will be created
  + resource "random_uuid" "scope_api_request_b2c" {
      + id     = (known after apply)
      + result = (known after apply)
    }

  # module.data_store_db_v14.azurerm_postgresql_flexible_server_active_directory_administrator.pgsql_adadmin must be replaced
-/+ resource "azurerm_postgresql_flexible_server_active_directory_administrator" "pgsql_adadmin" {
      ~ id                  = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/pre-prod/providers/Microsoft.DBforPostgreSQL/flexibleServers/pre-db-prod/administrators/4d0554dd-fe60-424a-be9c-36636826d927" -> (known after apply)
      ~ object_id           = "4d0554dd-fe60-424a-be9c-36636826d927" -> "ef17f368-0aa5-43d5-9264-28080f83755e" # forces replacement
      ~ principal_name      = "DTS Platform Operations SC" -> "DTS Platform Operations PostgreSQL Admin Access SC" # forces replacement
        # (4 unchanged attributes hidden)
    }

  # module.finalsa_storage_account.azurerm_storage_account.storage_account will be updated in-place
  ~ resource "azurerm_storage_account" "storage_account" {
        id                                 = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/pre-prod/providers/Microsoft.Storage/storageAccounts/prefinalsaprod"
        name                               = "prefinalsaprod"
        tags                               = {
            "application"         = "pre-recorded-evidence"
            "builtFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#dts-pre-rec-evidence-tech"
            "environment"         = "production"
            "managedBy"           = "Pre Recorded Evidence"
        }
        # (97 unchanged attributes hidden)

      + network_rules {
          + bypass         = [
              + "AzureServices",
            ]
          + default_action = "Allow"
        }

        # (3 unchanged blocks hidden)
    }

  # module.ingestsa_storage_account.azurerm_storage_account.storage_account will be updated in-place
  ~ resource "azurerm_storage_account" "storage_account" {
        id                                 = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/pre-prod/providers/Microsoft.Storage/storageAccounts/preingestsaprod"
        name                               = "preingestsaprod"
        tags                               = {
            "application"         = "pre-recorded-evidence"
            "builtFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#dts-pre-rec-evidence-tech"
            "environment"         = "production"
            "managedBy"           = "Pre Recorded Evidence"
        }
        # (97 unchanged attributes hidden)

      + network_rules {
          + bypass         = [
              + "AzureServices",
            ]
          + default_action = "Allow"
        }

        # (3 unchanged blocks hidden)
    }

  # module.vodasa_storage_account.azurerm_storage_account.storage_account will be updated in-place
  ~ resource "azurerm_storage_account" "storage_account" {
        id                                 = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/pre-prod/providers/Microsoft.Storage/storageAccounts/prevodasaprod"
        name                               = "prevodasaprod"
        tags                               = {
            "application"         = "pre-recorded-evidence"
            "builtFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#dts-pre-rec-evidence-tech"
            "environment"         = "production"
            "managedBy"           = "Pre Recorded Evidence"
        }
        # (97 unchanged attributes hidden)

      ~ network_rules {
          ~ ip_rules                   = [
              - "45.144.57.252",
            ]
            # (3 unchanged attributes hidden)
        }

        # (3 unchanged blocks hidden)
    }

Plan: 1 to import, 2 to add, 11 to change, 1 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":1066,"Program":"tfcmt","SHA1":"","Target":"prod","Vars":{}} -->